app/controllers/autors_controller.rb

  def index
   @autors = Autor.all.select(:id, :nombre, :apellido)
---
SELECT "autors"."id", "autors"."nombre", "autors"."apellido" FROM "autors"

  def create
    @autor = Autor.new(autor_params)

    respond_to do |format|
      if @autor.save
---
INSERT INTO "autors" ("nombre", "apellido", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "x"], ["apellido", "xap"], ["created_at", "2018-05-15 14:53:30.326727"], ["updated_at", "2018-05-15 14:53:30.326727"]]

    def set_autor
      @autor = Autor.find(params[:id])
---
SELECT  "autors".* FROM "autors" WHERE "autors"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]