app/controllers/books_controller.rb

  def index
    @books = Book.all.all.select(:id, :titulo, :edicion)
---
SELECT "books"."id", "books"."titulo", "books"."edicion" FROM "books"

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("titulo", "edicion", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["titulo", "la pantera"], ["edicion", 1998], ["created_at", "2018-05-19 18:24:50.772775"], ["updated_at", "2018-05-19 18:24:50.772775"]]