app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all.select(:id, :nombre)
---
SELECT "usuarios"."id", "usuarios"."nombre" FROM "usuarios"

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("nombre", "contrasenha", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "hh"], ["contrasenha", "123"], ["created_at", "2018-05-19 18:56:43.344629"], ["updated_at", "2018-05-19 18:56:43.344629"]]